/*   ▣ 주제: SmartHome
     ▣ 기능: 전등(220Vac), 팬(12Vdc), OLED12864(I2C), Bluetooth(HC-05), 초음파센서, RFID(SPI), 서보모터 활용
     ▣ 회로 연결
       ============================================================================================
         아두이노(D)  :  2   ~3      4     ~5      ~6     7      8     ~9  ~10   ~11   12   13
                       Rx   Tx    (+)     S      Echo  Trig   Dat    RST  SDA  MOSI  MISO  SCK
                     <Bluetooth> <부저> <서보모터> <초음파 센서> <온습도>  <--------RFID----------->
       ============================================================================================
         아두이노(A)  : A0  A1     A2       A3     A4   A5
                      -   cds     팬      전등    SDA  SCL
                      -  <조도> <릴레이1> <릴레이2>  <OLED>
       ============================================================================================
                                    └────┴─ A2,A3포트는 디지털 출력포트로 사용
                      └─ A0는 여분 포트

     ▣ 제어 프로토콜 :  Lx(전등), Fx(환풍), Dx(출입), Uxx(거리-경계값), Txx(온도-경계값), Bxx(조도-경계값)
                      x의 값: 0-끄기, 1-켜기, 2-자동 혹은 경비, 3-차고(출입만 해당)  예] L1: 전등 켜기 , U10: 10cm 이내로 들어오면 경보
     ▣ 센서 값 범위: 초음파U(0~400),조도B[1023(어두운)~0(밝은)]
     ▣ OLED 화면 표시
     ┌---------------------------┐
     │ 24.7 `C     41.0 %        │ <--- 온도, 습도
     │ 120 cm     147 cds        │ <--- 거리, 조도
     │ L(2):1   F(0):0   D(0):0  │  <--- Lamp|Fan|Door(작동모드): 현재 상태(0-닫힘,1-열림)
     │ Door : Closed             │  <--- "Closed", "Opened", "Armed", "Garage"
     └---------------------------┘
     ▣ KNUE OSlab 2019 study 2019.5.16.
*/
